v2206/validatioin_CHAD/scalar_noDiff/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType          LES;

// LES
// {
//     turbulence          on;

//     printCoeffs         on;

//     LESModel            kEqn;

//     delta               cubeRootVol;

//     kEqnCoeffs
//         {
//             Ck          0.094;
//             Ce          1.048;
//         }
    
// }

LES
{
    LESModel        Smagorinsky;

    turbulence      on;

    printCoeffs     on;

    delta           cubeRootVol;

    kEqnCoeffs
    {
        filter simple;
    }

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.1;
    }
}



// ************************************************************************* //
