v2206/validatioin_CHAD/scalar_noDiff/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1; // 5;

deltaT          5e-3;

writeControl    adjustable;

writeInterval   0.01; // 1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

runTimeModifiable true;

maxCo           0.4;

maxDeltaT       1;

functions {

    // yPlus1
    // {
    //     // Mandatory entries (unmodifiable)
    //     type            yPlus;
    //     libs            (fieldFunctionObjects);

    //     // Optional (inherited) entries
    //     writePrecision  6;
    //     writeToFile     true;
    //     useUserTime     true;

    //     region          region0;
    //     enabled         true;
    //     log             true;
    //     timeStart       0;
    //     timeEnd         1000;
    //     executeControl  timeStep;
    //     executeInterval 1;
    //     writeControl    writeTime;
    //     writeInterval   1;

    // }

    scalar1
	{
	    type            scalarTransport;
	    functionObjectLibs ("libsolverFunctionObjects.so");
	    enabled true;
    
	    field           s;      //name of scalar field
	    nCorr           1;      //number of corrector loop
	    // D 0.0001;               //difussion coefficient
        // alphaD          0.1;    // Schmidt number^-1
        // alphaDt         10;     // Turbulent Schmidt number^-1
        alphaD          1e-20;  // Schmidt number^-1
        alphaDt         1e-20;  // Turbulent Schmidt number^-1

	    log yes;
	    writeControl    adjustable;
        writeInterval   1;
	}
}


// ************************************************************************* //
