v2206/validatioin_CHAD/scalar_noDiff/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue s 1e-3
);

regions
(
    boxToCell
    {
        box (0.40   0.80  -0.10) (0.60  1.00   0.10);
        // box (0.10   0.10  -0.10) (1.00  1.00   0.10);
        fieldValues
        (
            volScalarFieldValue s 1.1e-3
        );
    }
    // boxToCell
    // {
    //     box (0.4   -0.20   0.00) (0.60  0.00   0.10);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.lightFluid 0
    //         volScalarFieldValue alpha.denseFluid 1
    //         volScalarFieldValue T 250
    //     );
    // }
);


// ************************************************************************* //
